:PROPERTIES:
:ID:       3368C2A8-C34F-45C2-8601-1735BD712D74
:END:
#+title: shell

For all intents and purposes I stick with bash as a
traditional shell.

Though this project also reflects trying to move away from that model.

* [[id:436EB0B7-811E-4828-BBF7-4126517DD7C6][emacs]]

** sh-shell

#+begin_src emacs-lisp
  (describe-variable 'sh-shell)
#+end_src

#+RESULTS:
#+begin_example
sh-shell is a variable defined in ‘sh-script.el’.

Its value is ‘zsh’

The shell being programmed.  This is set by M-x sh-set-shell.

  This variable is safe as a file local variable if its value
  satisfies the predicate ‘symbolp’.
  Probably introduced at or before Emacs version 25.1.

#+end_example

** sh-set-shell

#+begin_src emacs-lisp
  (describe-function #'sh-set-shell)
#+end_src

#+RESULTS:
#+begin_example
sh-set-shell is an interactive byte-code-function in ‘sh-script.el’.

(sh-set-shell SHELL &optional NO-QUERY-FLAG INSERT-FLAG)

Set this buffer’s shell to SHELL (a string).
When used interactively, insert the proper starting #!-line,
and make the visited file executable via ‘executable-set-magic’,
perhaps querying depending on the value of ‘executable-query’.
(If given a prefix (i.e., C-u) don’t insert any starting #!
line.)

When this function is called noninteractively, INSERT-FLAG (the third
argument) controls whether to insert a #!-line and think about making
the visited file executable, and NO-QUERY-FLAG (the second argument)
controls whether to query about making the visited file executable.

Calls the value of ‘sh-set-shell-hook’ if set.

Shell script files can cause this function be called automatically
when the file is visited by having a ‘sh-shell’ file-local variable
whose value is the shell name (don’t quote it).

#+end_example

#+begin_src emacs-lisp
  (sh-set-shell 'bash)
#+end_src

#+RESULTS:

* Configuration for [[id:04B03591-50E7-41E2-A2A5-0C2893FAD39C][org-babel]]

#+BEGIN_SRC emacs-lisp
  (require 'ob-shell)
#+END_SRC

#+RESULTS:
: ob-shell

** org-babel-execute:shell

#+begin_src emacs-lisp
  (describe-function #'org-babel-execute:shell)
#+end_src

#+RESULTS:
: org-babel-execute:shell is a byte-code-function in ‘ob-shell.el’.
: 
: (org-babel-execute:shell BODY PARAMS)
: 
: Execute Shell BODY according to PARAMS.
: This function is called by ‘org-babel-execute-src-block’.
: 


** org-babel-shell-names

#+begin_src emacs-lisp
  (describe-variable 'org-babel-shell-names)
#+end_src

#+RESULTS:
#+begin_example
org-babel-shell-names is a variable defined in ‘ob-shell.el’.

Its value is
("sh" "bash" "zsh" "fish" "csh" "ash" "dash" "ksh" "mksh" "posh")

List of names of shell supported by babel shell code blocks.
Call ‘org-babel-shell-initialize’ when modifying this variable
outside the Customize interface.

  You can customize this variable.

#+end_example

** options

*** Changing shell

Just name the shell in the block.

#+begin_src bash
  echo ${0}
#+end_src

#+RESULTS:
: bash

#+begin_src sh
  echo ${0}
#+end_src

#+RESULTS:
: sh

*** :shebang

*** redirecting-in-ob-blocks
:PROPERTIES:
:ID:       4BB51003-3806-4D02-8191-A8B596690E33
:END:

This can be done by adding an appropriate [[id:BDA4C8F0-3B66-4819-B2B1-BBC8FE727EBC][:prologue]].

#+begin_src shell
  echo "foo" >&2
#+end_src

#+RESULTS:

#+begin_src shell :prologue "exec 2>&1"
  echo "foo" >&2
#+end_src

#+RESULTS:
: foo

* Help

#+begin_src shell :shebang /bin/bash :results output
  help
#+end_src

#+RESULTS:
#+begin_example
GNU bash, version 3.2.57(1)-release (arm64-apple-darwin25)
These shell commands are defined internally.  Type `help' to see this list.
Type `help name' to find out more about the function `name'.
Use `info bash' to find out more about the shell in general.
Use `man -k' or `info' to find out more about commands not in this list.

A star (*) next to a name means that the command is disabled.

 JOB_SPEC [&]                       (( expression ))
 . filename [arguments]             :
 [ arg... ]                         [[ expression ]]
 alias [-p] [name[=value] ... ]     bg [job_spec ...]
 bind [-lpvsPVS] [-m keymap] [-f fi break [n]
 builtin [shell-builtin [arg ...]]  caller [EXPR]
 case WORD in [PATTERN [| PATTERN]. cd [-L|-P] [dir]
 command [-pVv] command [arg ...]   compgen [-abcdefgjksuv] [-o option
 complete [-abcdefgjksuv] [-pr] [-o continue [n]
 declare [-afFirtx] [-p] [name[=val dirs [-clpv] [+N] [-N]
 disown [-h] [-ar] [jobspec ...]    echo [-neE] [arg ...]
 enable [-pnds] [-a] [-f filename]  eval [arg ...]
 exec [-cl] [-a name] file [redirec exit [n]
 export [-nf] [name[=value] ...] or false
 fc [-e ename] [-nlr] [first] [last fg [job_spec]
 for NAME [in WORDS ... ;] do COMMA for (( exp1; exp2; exp3 )); do COM
 function NAME { COMMANDS ; } or NA getopts optstring name [arg]
 hash [-lr] [-p pathname] [-dt] [na help [-s] [pattern ...]
 history [-c] [-d offset] [n] or hi if COMMANDS; then COMMANDS; [ elif
 jobs [-lnprs] [jobspec ...] or job kill [-s sigspec | -n signum | -si
 let arg [arg ...]                  local name[=value] ...
 logout                             popd [+N | -N] [-n]
 printf [-v var] format [arguments] pushd [dir | +N | -N] [-n]
 pwd [-LP]                          read [-ers] [-u fd] [-t timeout] [
 readonly [-af] [name[=value] ...]  return [n]
 select NAME [in WORDS ... ;] do CO set [--abefhkmnptuvxBCHP] [-o opti
 shift [n]                          shopt [-pqsu] [-o long-option] opt
 source filename [arguments]        suspend [-f]
 test [expr]                        time [-p] PIPELINE
 times                              trap [-lp] [arg signal_spec ...]
 true                               type [-afptP] name [name ...]
 typeset [-afFirtx] [-p] name[=valu ulimit [-SHacdfilmnpqstuvx] [limit
 umask [-p] [-S] [mode]             unalias [-a] name [name ...]
 unset [-f] [-v] [name ...]         until COMMANDS; do COMMANDS; done
 variables - Some variable names an wait [n]
 while COMMANDS; do COMMANDS; done  { COMMANDS ; }
#+end_example

* Utilities

Many of these are not part of the shell but include here as part of
the standard shell experience.

** which

Output path to utility

#+begin_src emacs-lisp
  (->string nil (man "which"))
#+end_src

#+RESULTS:
#+begin_example
WHICH(1)                    General Commands Manual                   WHICH(1)

NAME
     which – locate a program file in the user's path

SYNOPSIS
     which [-as] program ...

DESCRIPTION
     The which utility takes a list of command names and searches the path for
     each executable file that would be run had these commands actually been
     invoked.

     The following options are available:

     -a      List all instances of executables found (instead of just the
             first one of each).

     -s      No output, just return 0 if all of the executables are found, or
             1 if some were not found.

     Some shells may provide a builtin which command which is similar or
     identical to this utility.  Consult the builtin(1) manual page.

EXAMPLES
     Locate the ls(1) and cp(1) commands:

           $ /usr/bin/which ls cp
           /bin/ls
           /bin/cp

     Same as above with a specific PATH and showing all occurrences:

           $ PATH=/bin:/rescue /usr/bin/which -a ls cp
           /bin/ls
           /rescue/ls
           /bin/cp
           /rescue/cp

     which will show duplicates if the same executable is found more than
     once:

           $ PATH=/bin:/bin /usr/bin/which -a ls
           /bin/ls
           /bin/ls

     Do not show output.  Just exit with an appropriate return code:

           $ /usr/bin/which -s ls cp
           $ echo $?
           0

           $ /usr/bin/which -s fakecommand
           $ echo $?
           1

SEE ALSO
     builtin(1), csh(1), find(1), locate(1), whereis(1)

HISTORY
     The which command first appeared in FreeBSD 2.1.

AUTHORS
     The which utility was originally written in Perl and was contributed by
     Wolfram Schneider <wosch@FreeBSD.org>.  The current version of which was
     rewritten in C by Daniel Papasian <dpapasia@andrew.cmu.edu>.

macOS 26.3                    September 24, 2020                    macOS 26.3
#+end_example

#+begin_src shell
  which env
#+end_src

#+RESULTS:
: /usr/bin/env

* Redirections

The use of stdin/stdout along with the ability to do piping and
redirections are enormously useful but seems to be underutilized in
modern development.

** Process Substitution

One of the less commonly used mechansims is process substition which
makes use of temporary file handles. This can be useful in cases of
trying to pipe multiple pipeline inputs, or when a tool is not
designed to work with stdin.

#+begin_src shell
  cat <(echo 'foo')
#+end_src

#+RESULTS:
: foo

** named-pipes
:PROPERTIES:
:ID:       09E86C21-F897-4399-A15B-5CD6BF13D13B
:END:

*** mkfifo

#+begin_src emacs-lisp
  (with-current-buffer (man "mkfifo")
    (buffer-string))
#+end_src

#+RESULTS:
#+begin_example
MKFIFO(1)                   General Commands Manual                  MKFIFO(1)

NAME
     mkfifo – make fifos

SYNOPSIS
     mkfifo [-m mode] fifo_name ...

DESCRIPTION
     The mkfifo utility creates the fifos requested, in the order specified.

     The options are as follows:

     -m      Set the file permission bits of the created fifos to the
             specified mode, ignoring the umask(2) of the calling process.
             The mode argument takes any format that can be specified to the
             chmod(1) command.  If a symbolic mode is specified, the op
             symbols ‘+’ (plus) and ‘-’ (hyphen) are interpreted relative to
             an assumed initial mode of “a=rw” (read and write permissions for
             all).

     If the -m option is not specified, fifos are created with mode 0666
     modified by the umask(2) of the calling process.  The mkfifo utility
     requires write permission in the parent directory.

EXIT STATUS
     The mkfifo utility exits 0 on success, and >0 if an error occurs.

SEE ALSO
     mkdir(1), rm(1), umask(1), mkfifo(2), mknod(2), umask(2), compat(5),
     mknod(8)

STANDARDS
     The mkfifo utility is expected to be IEEE Std 1003.2 (“POSIX.2”)
     compliant.

HISTORY
     The mkfifo command appeared in 4.4BSD.

macOS 26.3                      January 5, 1994                     macOS 26.3
#+end_example


